<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class HomepageController extends Controller
{
    public function index(Request $request) {
        $data['title'] = 'CRM-система';
        $data['keywords'] = 'CRM-система1';
        $data['description'] = 'CRM-система2';
        $data['sign_in'] = 'Увійти';
        $data['sign_up'] = 'Зареєструватись';
        //From DB
        $data['article_home_page'] = "<p>До 1993 року ринок CRM складався з двох основних напрямків — автоматизації торгових представників (Sales Force Automation — SFA) та клієнтського обслуговування (Customer Service — CS). Первинне призначення автоматизованих систем управління територіальними продажами полягало в тому, щоб торгові представники могли управляти «точками дотику» своїх клієнтів, а також працювати з планом продаж, узгодженим із календарем. З часом подібні системи збагатилися впровадженням функції управління можливостями, що на практиці означало підтримку тактики та методології продаж, прийнятої в компанії, а також можливість взаємозв'язку з іншими підрозділами компанії, наприклад, із службою клієнтської підтримки чи сервісними службами. До 2000 року CRM-системи, як правило, були «однобокими» — так звані «менеджери контактів», системи підтримки маркетингових заходів чи системи для автоматизації сервісних служб. В період з 2000 по 2005 роки почав формуватися спільний бізнес компаній із споживачами (Colaborative Commerce — спільна комерція). Спільна комерція характеризується налагоджуванням інтерактивної взаємодії компаній з їхніми постійними партнерами через Інтернет. Така взаємодія передбачає надання зовнішнім користувачам значно ширшого доступу до корпоративної інформації у зв'язку з чим повинна базуватися на принципах гарантії безпеки та довіри до партнера а також на узгоджених правилах роботи. Після 2005 року наступила друга хвиля Colaborative Commerce, що базується на більшій відкритості ERP-систем. Провідні виробники стали створювати користувацькі інтерфейси для своїх ERP-систем, з'явилися електронні торговельні майданчики B2C, формується нова інфраструктура ведення бізнесу. У цьому випадку, на відміну від першої хвилі, мова іде про взаємодію «багато до багатьох», — підприємства співпрацюють не тільки з постійними партнерами, а й з усіма членами бізнес-суспільства. Практично усі сучасні CRM-системи отримали в більшій чи меншій мірі вказані вище можливості та рівні обробки та надання інформації — обробка і зберігання даних в колективних сховищах, розробка баз знань, інтернет-засоби для інтерактивної взаємодії з клієнтом засобами корпоративних порталів.</p>";
        
        $data['feedback_title'] = 'Залиште своє повідомлення: ';
        $data['feedback_nickname'] = 'Ім\'я: ' ;
        $data['feedback_message'] = 'Повідомлення: ';
        $data['submit'] = 'Відправити';

        if ($request->isMethod('post')) {
            $feedback['nickname'] = $request->input('feedback_nickname');
            $feedback['message'] = $request->input('feedback_message');
            ///////////Add to DB
            $data['message'] = 'Повідомлення відправлено!';
            //avoid re-sending data
            return redirect('/');
        }

        return view('Homepage.index', $data);
    }
}
